## Plan Result (1112: sbox_aria - Terraform Plan Apply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 5 to change, 21 to destroy.</code></pre>

* Create
  * local_file.config[&#34;00&#34;]
  * local_file.config[&#34;01&#34;]
  * local_file.config[&#34;02&#34;]
* Update
  * azurerm_private_dns_zone_virtual_network_link.webapps[&#34;01&#34;]
  * azurerm_private_dns_zone_virtual_network_link.webapps[&#34;02&#34;]
  * azurerm_private_endpoint.functionapp[&#34;01&#34;]
  * azurerm_private_endpoint.functionapp[&#34;02&#34;]
  * azurerm_private_endpoint.functionapp00[&#34;00&#34;]
* Delete
  * azurerm_linux_function_app.example[&#34;00-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-td&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-td&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-td&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_linux_function_app.example["00-af-aplfpa"] will be destroyed
  # (because azurerm_linux_function_app.example is not in configuration)
  - resource "azurerm_linux_function_app" "example" {
      - app_settings                                   = {
          - "AzureWebJobsFeatureFlags"                              = "EnableWorkerIndexing"
          - "BUILD_FLAGS"                                           = "UseExpressBuild"
          - "ENABLE_ORYX_BUILD"                                     = "true"
          - "ENVIRONMENT"                                           = "sbox"
          - "FUNCTIONS_WORKER_RUNTIME"                              = "python"
          - "LZ_KEY"                                                = "00"
          - "PYTHON_ENABLE_WORKER_EXTENSIONS"                       = "1"
          - "SCM_DO_BUILD_DURING_DEPLOYMENT"                        = "true"
          - "WEBSITE_CONTENTOVERVNET"                               = "1"
          - "WEBSITE_RUN_FROM_PACKAGE"                              = "1"
          - "XDG_CACHE_HOME"                                        = "/tmp/.cache"
          - "sboxdlrmeventhubns_RootManageSharedAccessKey_EVENTHUB" = (sensitive value)
        } -> null
      - builtin_logging_enabled                        = true -> null
      - client_certificate_enabled                     = false -> null
      - client_certificate_mode                        = "Optional" -> null
      - content_share_force_disabled                   = false -> null
      - custom_domain_verification_id                  = (sensitive value) -> null
      - daily_memory_time_quota                        = 0 -> null
      - default_hostname                               = "af-aplfpa-sbox00-uks-dlrm-01.azurewebsites.net" -> null
      - enabled                                        = true -> null
      - ftp_publish_basic_authentication_enabled       = true -> null
      - functions_extension_version                    = "~4" -> null
      - https_only                                     = false -> null
      - id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-aplfpa-sbox00-uks-dlrm-01" -> null
      - key_vault_reference_identity_id                = "SystemAssigned" -> null
      - kind                                           = "functionapp,linux" -> null
      - location                                       = "uksouth" -> null
      - name                                           = "af-aplfpa-sbox00-uks-dlrm-01" -> null
      - outbound_ip_address_list                       = [
          - "51.140.177.236",
          - "51.140.46.202",
          - "51.140.84.145",
        ] -> null
      - outbound_ip_addresses                          = "51.140.177.236,51.140.46.202,51.140.84.145" -> null
      - possible_outbound_ip_address_list              = [
          - "51.140.60.161",
          - "51.140.61.32",
          - "51.140.68.240",
          - "51.140.64.162",
          - "51.140.177.236",
          - "51.140.46.202",
          - "51.132.208.31",
          - "20.49.154.81",
          - "20.77.142.8",
          - "20.77.142.177",
          - "20.77.143.19",
          - "20.77.143.34",
          - "20.108.90.121",
          - "20.117.217.212",
          - "20.26.58.21",
          - "20.26.60.2",
          - "20.26.60.196",
          - "20.26.60.226",
          - "51.140.84.145",
        ] -> null
      - possible_outbound_ip_addresses                 = "51.140.60.161,51.140.61.32,51.140.68.240,51.140.64.162,51.140.177.236,51.140.46.202,51.132.208.31,20.49.154.81,20.77.142.8,20.77.142.177,20.77.143.19,20.77.143.34,20.108.90.121,20.117.217.212,20.26.58.21,20.26.60.2,20.26.60.196,20.26.60.226,51.140.84.145" -> null
      - public_network_access_enabled                  = true -> null
      - resource_group_name                            = "ingest00-main-sbox" -> null
      - service_plan_id                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/serverFarms/af-aplfpa-sbox00-uks-dlrm-01" -> null
      - site_credential                                = (sensitive value) -> null
      - storage_account_access_key                     = (sensitive value) -> null
      - storage_account_name                           = "ingest00xcuttingsbox" -> null
      - storage_uses_managed_identity                  = false -> null
      - tags                                           = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> null
      - virtual_network_backup_restore_enabled         = false -> null
      - virtual_network_subnet_id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-product-001-sbox" -> null
      - vnet_image_pull_enabled                        = false -> null
      - webdeploy_publish_basic_authentication_enabled = true -> null
        # (4 unchanged attributes hidden)

      - identity {
          - identity_ids = [] -> null
          - principal_id = "540a97c3-7669-4c96-98ca-654362b2092e" -> null
          - tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
          - type         = "SystemAssigned" -> null
        }

      - site_config {
          - always_on                                     = true -> null
          - app_scale_limit                               = 0 -> null
          - application_insights_connection_string        = (sensitive value) -> null
          - container_registry_use_managed_identity       = false -> null
          - default_documents                             = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
            ] -> null
          - detailed_error_logging_enabled                = false -> null
          - elastic_instance_minimum                      = 1 -> null
          - ftps_state                                    = "FtpsOnly" -> null
          - health_check_eviction_time_in_min             = 0 -> null
          - http2_enabled                                 = false -> null
          - ip_restriction_default_action                 = "Allow" -> null
          - linux_fx_version                              = "PYTHON|3.10" -> null
          - load_balancing_mode                           = "LeastRequests" -> null
          - managed_pipeline_mode                         = "Integrated" -> null
          - minimum_tls_version                           = "1.2" -> null
          - pre_warmed_instance_count                     = 0 -> null
          - remote_debugging_enabled                      = false -> null
          - runtime_scale_monitoring_enabled              = false -> null
          - scm_ip_restriction_default_action             = "Allow" -> null
          - scm_minimum_tls_version                       = "1.2" -> null
          - scm_type                                      = "None" -> null
          - scm_use_main_ip_restriction                   = false -> null
          - use_32_bit_worker                             = false -> null
          - vnet_route_all_enabled                        = false -> null
          - websockets_enabled                            = false -> null
          - worker_count                                  = 1 -> null
            # (7 unchanged attributes hidden)

          - application_stack {
              - python_version              = "3.10" -> null
              - use_custom_runtime          = false -> null
              - use_dotnet_isolated_runtime = false -> null
                # (4 unchanged attributes hidden)
            }
        }

      - timeouts {
          - read   = "10m" -> null
          - update = "40m" -> null
        }
    }

  # azurerm_linux_function_app.example["00-af-aplfta"] will be destroyed
  # (because azurerm_linux_function_app.example is not in configuration)
  - resource "azurerm_linux_function_app" "example" {
      - app_settings                                   = {
          - "AzureWebJobsFeatureFlags"                              = "EnableWorkerIndexing"
          - "BUILD_FLAGS"                                           = "UseExpressBuild"
          - "ENABLE_ORYX_BUILD"                                     = "true"
          - "ENVIRONMENT"                                           = "sbox"
          - "FUNCTIONS_WORKER_RUNTIME"                              = "python"
          - "LZ_KEY"                                                = "00"
          - "PYTHON_ENABLE_WORKER_EXTENSIONS"                       = "1"
          - "SCM_DO_BUILD_DURING_DEPLOYMENT"                        = "true"
          - "WEBSITE_CONTENTOVERVNET"                               = "1"
          - "WEBSITE_RUN_FROM_PACKAGE"                              = "1"
          - "XDG_CACHE_HOME"                                        = "/tmp/.cache"
          - "sboxdlrmeventhubns_RootManageSharedAccessKey_EVENTHUB" = (sensitive value)
        } -> null
      - builtin_logging_enabled                        = true -> null
      - client_certificate_enabled                     = false -> null
      - client_certificate_mode                        = "Optional" -> null
      - content_share_force_disabled                   = false -> null
      - custom_domain_verification_id                  = (sensitive value) -> null
      - daily_memory_time_quota                        = 0 -> null
      - default_hostname                               = "af-aplfta-sbox00-uks-dlrm-01.azurewebsites.net" -> null
      - enabled                                        = true -> null
      - ftp_publish_basic_authentication_enabled       = true -> null
      - functions_extension_version                    = "~4" -> null
      - https_only                                     = false -> null
      - id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-aplfta-sbox00-uks-dlrm-01" -> null
      - key_vault_reference_identity_id                = "SystemAssigned" -> null
      - kind                                           = "functionapp,linux" -> null
      - location                                       = "uksouth" -> null
      - name                                           = "af-aplfta-sbox00-uks-dlrm-01" -> null
      - outbound_ip_address_list                       = [
          - "51.140.177.236",
          - "51.140.46.202",
          - "51.140.84.145",
        ] -> null
      - outbound_ip_addresses                          = "51.140.177.236,51.140.46.202,51.140.84.145" -> null
      - possible_outbound_ip_address_list              = [
          - "51.140.60.161",
          - "51.140.61.32",
          - "51.140.68.240",
          - "51.140.64.162",
          - "51.140.177.236",
          - "51.140.46.202",
          - "51.132.208.31",
          - "20.49.154.81",
          - "20.77.142.8",
          - "20.77.142.177",
          - "20.77.143.19",
          - "20.77.143.34",
          - "20.108.90.121",
          - "20.117.217.212",
          - "20.26.58.21",
          - "20.26.60.2",
          - "20.26.60.196",
          - "20.26.60.226",
          - "51.140.84.145",
        ] -> null
      - possible_outbound_ip_addresses                 = "51.140.60.161,51.140.61.32,51.140.68.240,51.140.64.162,51.140.177.236,51.140.46.202,51.132.208.31,20.49.154.81,20.77.142.8,20.77.142.177,20.77.143.19,20.77.143.34,20.108.90.121,20.117.217.212,20.26.58.21,20.26.60.2,20.26.60.196,20.26.60.226,51.140.84.145" -> null
      - public_network_access_enabled                  = true -> null
      - resource_group_name                            = "ingest00-main-sbox" -> null
      - service_plan_id                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/serverFarms/af-aplfta-sbox00-uks-dlrm-01" -> null
      - site_credential                                = (sensitive value) -> null
      - storage_account_access_key                     = (sensitive value) -> null
      - storage_account_name                           = "ingest00xcuttingsbox" -> null
      - storage_uses_managed_identity                  = false -> null
      - tags                                           = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> null
      - virtual_network_backup_restore_enabled         = false -> null
      - virtual_network_subnet_id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-product-001-sbox" -> null
      - vnet_image_pull_enabled                        = false -> null
      - webdeploy_publish_basic_authentication_enabled = true -> null
        # (4 unchanged attributes hidden)

      - identity {
          - identity_ids = [] -> null
          - principal_id = "c1f46703-6bc2-4b4b-a6e5-3ebaab4176c0" -> null
          - tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
          - type         = "SystemAssigned" -> null
        }

      - site_config {
          - always_on                                     = true -> null
          - app_scale_limit                               = 0 -> null
          - application_insights_connection_string        = (sensitive value) -> null
          - container_registry_use_managed_identity       = false -> null
          - default_documents                             = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
            ] -> null
          - detailed_error_logging_enabled                = false -> null
          - elastic_instance_minimum                      = 1 -> null
          - ftps_state                                    = "FtpsOnly" -> null
          - health_check_eviction_time_in_min             = 0 -> null
          - http2_enabled                                 = false -> null
          - ip_restriction_default_action                 = "Allow" -> null
          - linux_fx_version                              = "PYTHON|3.10" -> null
          - load_balancing_mode                           = "LeastRequests" -> null
          - managed_pipeline_mode                         = "Integrated" -> null
          - minimum_tls_version                           = "1.2" -> null
          - pre_warmed_instance_count                     = 0 -> null
          - remote_debugging_enabled                      = false -> null
          - runtime_scale_monitoring_enabled              = false -> null
          - scm_ip_restriction_default_action             = "Allow" -> null
          - scm_minimum_tls_version                       = "1.2" -> null
          - scm_type                                      = "None" -> null
          - scm_use_main_ip_restriction                   = false -> null
          - use_32_bit_worker                             = false -> null
          - vnet_route_all_enabled                        = false -> null
          - websockets_enabled                            = false -> null
          - worker_count                                  = 1 -> null
            # (7 unchanged attributes hidden)

          - application_stack {
              - python_version              = "3.10" -> null
              - use_custom_runtime          = false -> null
              - use_dotnet_isolated_runtime = false -> null
                # (4 unchanged attributes hidden)
            }
        }

      - timeouts {
          - read   = "10m" -> null
          - update = "40m" -> null
        }
    }

  # azurerm_linux_function_app.example["00-af-apluta"] will be destroyed
  # (because azurerm_linux_function_app.example is not in configuration)
  - resource "azurerm_linux_function_app" "example" {
      - app_settings                                   = {
          - "AzureWebJobsFeatureFlags"                              = "EnableWorkerIndexing"
          - "BUILD_FLAGS"                                           = "UseExpressBuild"
          - "ENABLE_ORYX_BUILD"                                     = "true"
          - "ENVIRONMENT"                                           = "sbox"
          - "FUNCTIONS_WORKER_RUNTIME"                              = "python"
          - "LZ_KEY"                                                = "00"
          - "PYTHON_ENABLE_WORKER_EXTENSIONS"                       = "1"
          - "SCM_DO_BUILD_DURING_DEPLOYMENT"                        = "true"
          - "WEBSITE_CONTENTOVERVNET"                               = "1"
          - "WEBSITE_RUN_FROM_PACKAGE"                              = "1"
          - "XDG_CACHE_HOME"                                        = "/tmp/.cache"
          - "sboxdlrmeventhubns_RootManageSharedAccessKey_EVENTHUB" = (sensitive value)
        } -> null
      - builtin_logging_enabled                        = true -> null
      - client_certificate_enabled                     = false -> null
      - client_certificate_mode                        = "Optional" -> null
      - content_share_force_disabled                   = false -> null
      - custom_domain_verification_id                  = (sensitive value) -> null
      - daily_memory_time_quota                        = 0 -> null
      - default_hostname                               = "af-apluta-sbox00-uks-dlrm-01.azurewebsites.net" -> null
      - enabled                                        = true -> null
      - ftp_publish_basic_authentication_enabled       = true -> null
      - functions_extension_version                    = "~4" -> null
      - https_only                                     = false -> null
      - id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-apluta-sbox00-uks-dlrm-01" -> null
      - key_vault_reference_identity_id                = "SystemAssigned" -> null
      - kind                                           = "functionapp,linux" -> null
      - location                                       = "uksouth" -> null
      - name                                           = "af-apluta-sbox00-uks-dlrm-01" -> null
      - outbound_ip_address_list                       = [
          - "51.140.177.236",
          - "51.140.46.202",
          - "51.140.84.145",
        ] -> null
      - outbound_ip_addresses                          = "51.140.177.236,51.140.46.202,51.140.84.145" -> null
      - possible_outbound_ip_address_list              = [
          - "51.140.60.161",
          - "51.140.61.32",
          - "51.140.68.240",
          - "51.140.64.162",
          - "51.140.177.236",
          - "51.140.46.202",
          - "51.132.208.31",
          - "20.49.154.81",
          - "20.77.142.8",
          - "20.77.142.177",
          - "20.77.143.19",
          - "20.77.143.34",
          - "20.108.90.121",
          - "20.1

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

- "20.49.243.199",
          - "20.90.134.28",
        ] -> null
      - possible_outbound_ip_addresses                 = "20.49.241.240,20.49.242.29,20.49.242.61,20.49.242.68,20.49.242.92,20.49.242.171,20.49.174.115,20.49.174.138,20.49.174.159,20.49.174.164,20.49.174.187,20.49.175.107,20.49.175.166,20.49.240.48,20.49.240.76,20.49.240.198,20.49.240.241,20.49.241.32,20.49.241.62,20.49.241.70,20.49.241.88,20.49.241.216,20.49.241.223,20.49.241.234,20.49.243.58,20.49.243.61,20.49.243.176,20.49.243.182,20.49.243.196,20.49.243.199,20.90.134.28" -> null
      - public_network_access_enabled                  = true -> null
      - resource_group_name                            = "ingest02-main-sbox" -> null
      - service_plan_id                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/serverFarms/af-sbails-sbox02-uks-dlrm-01" -> null
      - site_credential                                = (sensitive value) -> null
      - storage_account_access_key                     = (sensitive value) -> null
      - storage_account_name                           = "ingest02xcuttingsbox" -> null
      - storage_uses_managed_identity                  = false -> null
      - tags                                           = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> null
      - virtual_network_backup_restore_enabled         = false -> null
      - virtual_network_subnet_id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest02-vnet-sbox/subnets/ingest02-data-product-001-sbox" -> null
      - vnet_image_pull_enabled                        = false -> null
      - webdeploy_publish_basic_authentication_enabled = true -> null
        # (4 unchanged attributes hidden)

      - identity {
          - identity_ids = [] -> null
          - principal_id = "f01f0da0-70e8-4754-bb79-199f2743c60c" -> null
          - tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
          - type         = "SystemAssigned" -> null
        }

      - site_config {
          - always_on                                     = true -> null
          - app_scale_limit                               = 0 -> null
          - application_insights_connection_string        = (sensitive value) -> null
          - container_registry_use_managed_identity       = false -> null
          - default_documents                             = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
            ] -> null
          - detailed_error_logging_enabled                = false -> null
          - elastic_instance_minimum                      = 1 -> null
          - ftps_state                                    = "FtpsOnly" -> null
          - health_check_eviction_time_in_min             = 0 -> null
          - http2_enabled                                 = false -> null
          - ip_restriction_default_action                 = "Allow" -> null
          - linux_fx_version                              = "PYTHON|3.10" -> null
          - load_balancing_mode                           = "LeastRequests" -> null
          - managed_pipeline_mode                         = "Integrated" -> null
          - minimum_tls_version                           = "1.2" -> null
          - pre_warmed_instance_count                     = 0 -> null
          - remote_debugging_enabled                      = false -> null
          - runtime_scale_monitoring_enabled              = false -> null
          - scm_ip_restriction_default_action             = "Allow" -> null
          - scm_minimum_tls_version                       = "1.2" -> null
          - scm_type                                      = "None" -> null
          - scm_use_main_ip_restriction                   = false -> null
          - use_32_bit_worker                             = false -> null
          - vnet_route_all_enabled                        = false -> null
          - websockets_enabled                            = false -> null
          - worker_count                                  = 1 -> null
            # (7 unchanged attributes hidden)

          - application_stack {
              - python_version              = "3.10" -> null
              - use_custom_runtime          = false -> null
              - use_dotnet_isolated_runtime = false -> null
                # (4 unchanged attributes hidden)
            }
        }

      - timeouts {
          - read   = "10m" -> null
          - update = "40m" -> null
        }
    }

  # azurerm_linux_function_app.example["02-af-td"] will be destroyed
  # (because azurerm_linux_function_app.example is not in configuration)
  - resource "azurerm_linux_function_app" "example" {
      - app_settings                                   = {
          - "AzureWebJobsFeatureFlags"                              = "EnableWorkerIndexing"
          - "BUILD_FLAGS"                                           = "UseExpressBuild"
          - "ENABLE_ORYX_BUILD"                                     = "true"
          - "ENVIRONMENT"                                           = "sbox"
          - "FUNCTIONS_WORKER_RUNTIME"                              = "python"
          - "LZ_KEY"                                                = "02"
          - "PYTHON_ENABLE_WORKER_EXTENSIONS"                       = "1"
          - "SCM_DO_BUILD_DURING_DEPLOYMENT"                        = "true"
          - "WEBSITE_CONTENTOVERVNET"                               = "1"
          - "WEBSITE_RUN_FROM_PACKAGE"                              = "1"
          - "XDG_CACHE_HOME"                                        = "/tmp/.cache"
          - "sboxdlrmeventhubns_RootManageSharedAccessKey_EVENTHUB" = (sensitive value)
        } -> null
      - builtin_logging_enabled                        = true -> null
      - client_certificate_enabled                     = false -> null
      - client_certificate_mode                        = "Optional" -> null
      - content_share_force_disabled                   = false -> null
      - custom_domain_verification_id                  = (sensitive value) -> null
      - daily_memory_time_quota                        = 0 -> null
      - default_hostname                               = "af-td-sbox02-uks-dlrm-01.azurewebsites.net" -> null
      - enabled                                        = true -> null
      - ftp_publish_basic_authentication_enabled       = true -> null
      - functions_extension_version                    = "~4" -> null
      - https_only                                     = false -> null
      - id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-td-sbox02-uks-dlrm-01" -> null
      - key_vault_reference_identity_id                = "SystemAssigned" -> null
      - kind                                           = "functionapp,linux" -> null
      - location                                       = "uksouth" -> null
      - name                                           = "af-td-sbox02-uks-dlrm-01" -> null
      - outbound_ip_address_list                       = [
          - "20.49.175.166",
          - "20.49.240.48",
          - "20.49.240.76",
          - "20.49.240.198",
          - "20.49.240.241",
          - "20.49.241.32",
          - "20.90.134.28",
        ] -> null
      - outbound_ip_addresses                          = "20.49.175.166,20.49.240.48,20.49.240.76,20.49.240.198,20.49.240.241,20.49.241.32,20.90.134.28" -> null
      - possible_outbound_ip_address_list              = [
          - "20.49.241.240",
          - "20.49.242.29",
          - "20.49.242.61",
          - "20.49.242.68",
          - "20.49.242.92",
          - "20.49.242.171",
          - "20.49.174.115",
          - "20.49.174.138",
          - "20.49.174.159",
          - "20.49.174.164",
          - "20.49.174.187",
          - "20.49.175.107",
          - "20.49.175.166",
          - "20.49.240.48",
          - "20.49.240.76",
          - "20.49.240.198",
          - "20.49.240.241",
          - "20.49.241.32",
          - "20.49.241.62",
          - "20.49.241.70",
          - "20.49.241.88",
          - "20.49.241.216",
          - "20.49.241.223",
          - "20.49.241.234",
          - "20.49.243.58",
          - "20.49.243.61",
          - "20.49.243.176",
          - "20.49.243.182",
          - "20.49.243.196",
          - "20.49.243.199",
          - "20.90.134.28",
        ] -> null
      - possible_outbound_ip_addresses                 = "20.49.241.240,20.49.242.29,20.49.242.61,20.49.242.68,20.49.242.92,20.49.242.171,20.49.174.115,20.49.174.138,20.49.174.159,20.49.174.164,20.49.174.187,20.49.175.107,20.49.175.166,20.49.240.48,20.49.240.76,20.49.240.198,20.49.240.241,20.49.241.32,20.49.241.62,20.49.241.70,20.49.241.88,20.49.241.216,20.49.241.223,20.49.241.234,20.49.243.58,20.49.243.61,20.49.243.176,20.49.243.182,20.49.243.196,20.49.243.199,20.90.134.28" -> null
      - public_network_access_enabled                  = true -> null
      - resource_group_name                            = "ingest02-main-sbox" -> null
      - service_plan_id                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/serverFarms/af-td-sbox02-uks-dlrm-01" -> null
      - site_credential                                = (sensitive value) -> null
      - storage_account_access_key                     = (sensitive value) -> null
      - storage_account_name                           = "ingest02xcuttingsbox" -> null
      - storage_uses_managed_identity                  = false -> null
      - tags                                           = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> null
      - virtual_network_backup_restore_enabled         = false -> null
      - virtual_network_subnet_id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest02-vnet-sbox/subnets/ingest02-data-product-001-sbox" -> null
      - vnet_image_pull_enabled                        = false -> null
      - webdeploy_publish_basic_authentication_enabled = true -> null
        # (4 unchanged attributes hidden)

      - identity {
          - identity_ids = [] -> null
          - principal_id = "bb3003a6-3379-4d86-a2e9-0778e0ab0fdf" -> null
          - tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
          - type         = "SystemAssigned" -> null
        }

      - site_config {
          - always_on                                     = true -> null
          - app_scale_limit                               = 0 -> null
          - application_insights_connection_string        = (sensitive value) -> null
          - container_registry_use_managed_identity       = false -> null
          - default_documents                             = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
            ] -> null
          - detailed_error_logging_enabled                = false -> null
          - elastic_instance_minimum                      = 1 -> null
          - ftps_state                                    = "FtpsOnly" -> null
          - health_check_eviction_time_in_min             = 0 -> null
          - http2_enabled                                 = false -> null
          - ip_restriction_default_action                 = "Allow" -> null
          - linux_fx_version                              = "PYTHON|3.10" -> null
          - load_balancing_mode                           = "LeastRequests" -> null
          - managed_pipeline_mode                         = "Integrated" -> null
          - minimum_tls_version                           = "1.2" -> null
          - pre_warmed_instance_count                     = 0 -> null
          - remote_debugging_enabled                      = false -> null
          - runtime_scale_monitoring_enabled              = false -> null
          - scm_ip_restriction_default_action             = "Allow" -> null
          - scm_minimum_tls_version                       = "1.2" -> null
          - scm_type                                      = "None" -> null
          - scm_use_main_ip_restriction                   = false -> null
          - use_32_bit_worker                             = false -> null
          - vnet_route_all_enabled                        = false -> null
          - websockets_enabled                            = false -> null
          - worker_count                                  = 1 -> null
            # (7 unchanged attributes hidden)

          - application_stack {
              - python_version              = "3.10" -> null
              - use_custom_runtime          = false -> null
              - use_dotnet_isolated_runtime = false -> null
                # (4 unchanged attributes hidden)
            }
        }

      - timeouts {
          - read   = "10m" -> null
          - update = "40m" -> null
        }
    }

  # azurerm_private_dns_zone_virtual_network_link.webapps["01"] will be updated in-place
  ~ resource "azurerm_private_dns_zone_virtual_network_link" "webapps" {
        id                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net/virtualNetworkLinks/vnet-link-01-webapps"
        name                  = "vnet-link-01-webapps"
      ~ tags                  = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (4 unchanged attributes hidden)
    }

  # azurerm_private_dns_zone_virtual_network_link.webapps["02"] will be updated in-place
  ~ resource "azurerm_private_dns_zone_virtual_network_link" "webapps" {
        id                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net/virtualNetworkLinks/vnet-link-02-webapps"
        name                  = "vnet-link-02-webapps"
      ~ tags                  = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (4 unchanged attributes hidden)
    }

  # azurerm_private_endpoint.functionapp["01"] will be updated in-place
  ~ resource "azurerm_private_endpoint" "functionapp" {
        id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Network/privateEndpoints/pe-01-functionapp"
        name                          = "pe-01-functionapp"
      ~ tags                          = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_private_endpoint.functionapp["02"] will be updated in-place
  ~ resource "azurerm_private_endpoint" "functionapp" {
        id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Network/privateEndpoints/pe-02-functionapp"
        name                          = "pe-02-functionapp"
      ~ tags                          = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_private_endpoint.functionapp00["00"] will be updated in-place
  ~ resource "azurerm_private_endpoint" "functionapp00" {
        id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Network/privateEndpoints/pe-00-functionapp"
        name                          = "pe-00-functionapp"
      ~ tags                          = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # local_file.config["00"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "00"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_00.json"
      + id                   = (known after apply)
    }

  # local_file.config["01"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "01"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_01.json"
      + id                   = (known after apply)
    }

  # local_file.config["02"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "02"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_02.json"
      + id                   = (known after apply)
    }

Plan: 3 to add, 5 to change, 21 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":124,"Program":"tfcmt","SHA1":"","Target":"1112: sbox_aria - Terraform Plan Apply","Vars":{}} -->